//
//  marray.cpp
//  nadocoding
//
//  Created by 안동규 on 2021/07/08.
//

#include <stdio.h>

int main_m_array(void)
{
    // 다차원 배열 multidimensional array
//    int i;  // ㅁ 일반적인 정수 변수선언
//
//    int arr1[5];  // ㅁㅁㅁㅁㅁ 정수 배열 선언
//    // [0][1][2][3][4]
//
//    int arr2_2[2][5];  // 2차원 배열은, 이게 다차원 배열 선언
//    // 뒤에서부터 읽어가면 됨.
//    // 5개의 칸을 가진 것이 2개 있음!
//    // ㅁㅁㅁㅁㅁ
//    // ㅁㅁㅁㅁㅁ 그림으로 표현하면 이렇게 된다.
//    // [0,0][0,1][0,2][0,3][0,4] -> 좌표처럼 적어주면 된다.
//    // [1,0][1,1][1,2][1,3][1,4] -> 실제로 표기할 때는 arr2[1][4] 와 같이 표기를 한다.
//
//
//
//    // 그럼 3차원 배열도 있음?
//    int arr4_4[3][3][3];
//    // ㅁㅁㅁ arr4[0][0][0] arr4[0][0][1] arr4[0][0][2]
//    // ㅁㅁㅁ arr4[0][1][0] arr4[0][1][1] arr4[0][1][2]
//    // ㅁㅁㅁ arr4[0][2][0] arr4[0][2][1] arr4[0][2][2]
//
//    // ㅁㅁㅁ arr4[1][0][0] arr4[1][0][1] arr4[1][0][2]
//    // ㅁㅁㅁ arr4[1][1][0] arr4[1][1][1] arr4[1][1][2]
//    // ㅁㅁㅁ arr4[1][2][0] arr4[1][2][1] arr4[1][2][2]
//
//    // ㅁㅁㅁ arr4[2][0][0] arr4[2][0][1] arr4[2][0][2]
//    // ㅁㅁㅁ arr4[2][1][0] arr4[2][1][1] arr4[2][1][2]
//    // ㅁㅁㅁ arr4[2][2][0] arr4[2][2][1] arr4[2][2][2]
//
//    // 다차원 배열의 선언
    int arr[5]={1,2,3,4,5};
    int arr2[2][5]={
        {1,2,3,4,5},
        {1,2,3,4,5}
    };
    
    int arr3[4][2]={
        {1,2},
        {3,4},
        {5,6},
        {7,8}
    };
    
    
    int arr4[3][3][3]={
        {
            {1,2,3},
            {4,5,6},
            {7,8,9}
        },
        {
            {1,2,3},
            {4,5,6},
            {7,8,9}
        },
        {
            {1,2,3},
            {4,5,6},
            {7,8,9}
        }   
    };
    
    // 다차원 배열의 사용
    // 2차원 배열은
    // 사용을 할때는 for문을 2번 사용해주면 된다.
//    for(int i=0; i<4; i++)
//    {
//        for(int j=0; j<2; j++)
//        {
//            printf("2차원배열 (%d,%d)의 값은 : %d\n", i,j,arr3[i][j]);
//        }
//        printf("\n");
//    }
    
    // 3차원 배열은 어떻게 사용을 하는가?
    // for을 3번 써주면 된다.
    for(int i=0; i<3; i++)
    {
        for(int j=0; j<3; j++)
            {
            for(int k=0; k<3; k++)
            {
                printf("3차원배열 (%d,%d,%d)의 값은 : %d\n", i,j,k,arr4[i][j][k]);
            }
                printf("\n");
            }
        printf("\n");
    }
    
    
    return 0;
}
